ZXCLI/Multiphase-Interleaved-CLLC/CLLC.syscfg
epwm1.$name                                                    = "M_EPWM1";
epwm1.epwmCounterCompare_cmpB                                  = 250;
epwm1.epwmDeadband_polarityFED                                 = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm1.hrpwm_edgeModeA                                          = "HRPWM_MEP_CTRL_RISING_AND_FALLING_EDGE";
epwm1.hrpwm_HRLoadA                                            = "HRPWM_LOAD_ON_CNTR_ZERO_PERIOD";
epwm1.hrpwm_edgeModeB                                          = "HRPWM_MEP_CTRL_RISING_AND_FALLING_EDGE";
epwm1.hrpwm_HRLoadB                                            = "HRPWM_LOAD_ON_CNTR_ZERO_PERIOD";
epwm1.hrpwm_DBredHR                                            = 2;
epwm1.hrpwm_DBfedHR                                            = 2;
epwm1.epwmTimebase_hsClockDiv                                  = "EPWM_HSCLOCK_DIVIDER_1";
epwm1.epwmTimebase_counterMode                                 = "EPWM_COUNTER_MODE_UP";
epwm1.hrpwm_edgeModeDB                                         = "HRPWM_DB_MEP_CTRL_RED_FED";
epwm1.copyFrom                                                 = "M_EPWM2";
epwm1.epwmDeadband_enableRED                                   = true;
epwm1.epwmDeadband_redShadowMode                               = true;
epwm1.epwmDeadband_enableFED                                   = true;
epwm1.epwmDeadband_fedShadowMode                               = true;
epwm1.epwmDeadband_delayRED                                    = 20;
epwm1.epwmDeadband_delayFED                                    = 20;
epwm1.epwmDeadband_deadbandCounterClockRate                    = "EPWM_DB_COUNTER_CLOCK_HALF_CYCLE";
epwm1.copyUse                                                  = true;
epwm1.epwmTimebase_syncOutPulseMode                            = "EPWM_SYNC_OUT_PULSE_ON_COUNTER_ZERO";
epwm1.epwmTimebase_period                                      = 1120;
epwm1.epwmCounterCompare_cmpA                                  = 560;
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_ZERO    = "EPWM_AQ_OUTPUT_LOW";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA = "EPWM_AQ_OUTPUT_HIGH";
epwm1.epwm.$assign                                             = "EPWM1";

epwm2.$name                                                    = "M_EPWM2";
epwm2.epwmTimebase_hsClockDiv                                  = "EPWM_HSCLOCK_DIVIDER_1";
epwm2.epwmTimebase_counterMode                                 = "EPWM_COUNTER_MODE_UP";
epwm2.epwmDeadband_polarityFED                                 = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm2.hrpwm_edgeModeA                                          = "HRPWM_MEP_CTRL_RISING_AND_FALLING_EDGE";
epwm2.hrpwm_HRLoadA                                            = "HRPWM_LOAD_ON_CNTR_ZERO_PERIOD";
epwm2.hrpwm_edgeModeB                                          = "HRPWM_MEP_CTRL_RISING_AND_FALLING_EDGE";
epwm2.hrpwm_HRLoadB                                            = "HRPWM_LOAD_ON_CNTR_ZERO_PERIOD";
epwm2.hrpwm_edgeModeDB                                         = "HRPWM_DB_MEP_CTRL_RED_FED";
epwm2.hrpwm_DBredHR                                            = 2;
epwm2.hrpwm_DBfedHR                                            = 2;
epwm2.epwmDeadband_enableRED                                   = true;
epwm2.epwmDeadband_redShadowMode                               = true;
epwm2.epwmDeadband_delayRED                                    = 20;
epwm2.epwmDeadband_enableFED                                   = true;
epwm2.epwmDeadband_fedShadowMode                               = true;
epwm2.epwmDeadband_delayFED                                    = 20;
epwm2.epwmDeadband_deadbandCounterClockRate                    = "EPWM_DB_COUNTER_CLOCK_HALF_CYCLE";
epwm2.epwmTimebase_syncOutPulseMode                            = "EPWM_SYNC_OUT_PULSE_ON_EPWMxSYNCIN";
epwm2.copyFrom                                                 = "M_EPWM3";
epwm2.epwmTimebase_period                                      = 1120;
epwm2.epwmCounterCompare_cmpA                                  = 560;
epwm2.epwmCounterCompare_cmpB                                  = 560;
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_ZERO    = "EPWM_AQ_OUTPUT_HIGH";
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA = "EPWM_AQ_OUTPUT_LOW";
epwm2.epwm.$assign                                             = "EPWM2";
epwm2.epwm.epwm_aPin.$assign                                   = "GPIO2";
epwm2.epwm.epwm_bPin.$assign                                   = "GPIO3";

epwm3.$name                                                    = "M_EPWM3";
epwm3.epwmTimebase_hsClockDiv                                  = "EPWM_HSCLOCK_DIVIDER_1";
epwm3.epwmTimebase_counterMode                                 = "EPWM_COUNTER_MODE_UP";
epwm3.epwmCounterCompare_cmpB                                  = 250;
epwm3.epwmDeadband_polarityFED                                 = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm3.hrpwm_edgeModeA                                          = "HRPWM_MEP_CTRL_RISING_AND_FALLING_EDGE";
epwm3.hrpwm_HRLoadA                                            = "HRPWM_LOAD_ON_CNTR_ZERO_PERIOD";
epwm3.hrpwm_edgeModeB                                          = "HRPWM_MEP_CTRL_RISING_AND_FALLING_EDGE";
epwm3.hrpwm_HRLoadB                                            = "HRPWM_LOAD_ON_CNTR_ZERO_PERIOD";
epwm3.hrpwm_edgeModeDB                                         = "HRPWM_DB_MEP_CTRL_RED_FED";
epwm3.hrpwm_DBredHR                                            = 2;
epwm3.hrpwm_DBfedHR                                            = 2;
epwm3.epwmDeadband_enableRED                                   = true;
epwm3.epwmDeadband_redShadowMode                               = true;
epwm3.epwmDeadband_enableFED                                   = true;
epwm3.epwmDeadband_fedShadowMode                               = true;
epwm3.epwmDeadband_deadbandCounterClockRate                    = "EPWM_DB_COUNTER_CLOCK_HALF_CYCLE";
epwm3.epwmTimebase_syncOutPulseMode                            = "EPWM_SYNC_OUT_PULSE_ON_EPWMxSYNCIN";
epwm3.copyUse                                                  = true;
epwm3.copyFrom                                                 = "M_EPWM2";
epwm3.epwmDeadband_delayRED                                    = 80;
epwm3.epwmDeadband_delayFED                                    = 80;
epwm3.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_PERIOD  = "EPWM_AQ_OUTPUT_TOGGLE";
epwm3.epwmCounterCompare_cmpAGld                               = true;
epwm3.epwmEventTrigger_EPWM_SOC_A_triggerEnable                = true;
epwm3.epwmEventTrigger_EPWM_SOC_A_triggerEventPrescalar        = "1";
epwm3.epwmDigitalCompare_EPWM_DC_TYPE_DCAH                     = "EPWM_DC_TRIP_TRIPIN10";
epwm3.epwmDigitalCompare_EPWM_DC_TYPE_DCAL                     = "EPWM_DC_TRIP_TRIPIN10";
epwm3.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_ZERO    = "EPWM_AQ_OUTPUT_HIGH";
epwm3.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA = "EPWM_AQ_OUTPUT_LOW";
epwm3.epwmCounterCompare_cmpA                                  = 560;
epwm3.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZA                    = "EPWM_TZ_ACTION_LOW";
epwm3.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZB                    = "EPWM_TZ_ACTION_LOW";
epwm3.epwmEventTrigger_EPWM_SOC_A_triggerSource                = "EPWM_SOC_TBCTR_U_CMPC";
epwm3.epwmCounterCompare_cmpC                                  = 448;
epwm3.epwmTimebase_period                                      = 1120;
epwm3.epwm.$assign                                             = "EPWM3";
epwm3.epwm.epwm_aPin.$assign                                   = "GPIO4";
epwm3.epwm.epwm_bPin.$assign                                   = "GPIO5";

epwm4.$name                                                    = "M_EPWM4";
epwm4.epwmTimebase_hsClockDiv                                  = "EPWM_HSCLOCK_DIVIDER_1";
epwm4.epwmTimebase_counterMode                                 = "EPWM_COUNTER_MODE_UP";
epwm4.epwmCounterCompare_cmpB                                  = 250;
epwm4.epwmDeadband_polarityFED                                 = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm4.hrpwm_edgeModeA                                          = "HRPWM_MEP_CTRL_RISING_AND_FALLING_EDGE";
epwm4.hrpwm_HRLoadA                                            = "HRPWM_LOAD_ON_CNTR_ZERO_PERIOD";
epwm4.hrpwm_edgeModeB                                          = "HRPWM_MEP_CTRL_RISING_AND_FALLING_EDGE";
epwm4.hrpwm_HRLoadB                                            = "HRPWM_LOAD_ON_CNTR_ZERO_PERIOD";
epwm4.hrpwm_edgeModeDB                                         = "HRPWM_DB_MEP_CTRL_RED_FED";
epwm4.hrpwm_DBredHR                                            = 2;
epwm4.hrpwm_DBfedHR                                            = 2;
epwm4.epwmDeadband_enableRED                                   = true;
epwm4.epwmDeadband_redShadowMode                               = true;
epwm4.epwmDeadband_enableFED                                   = true;
epwm4.epwmDeadband_fedShadowMode                               = true;
epwm4.epwmDeadband_deadbandCounterClockRate                    = "EPWM_DB_COUNTER_CLOCK_HALF_CYCLE";
epwm4.epwmTimebase_syncOutPulseMode                            = "EPWM_SYNC_OUT_PULSE_ON_EPWMxSYNCIN";
epwm4.copyUse                                                  = true;
epwm4.copyFrom                                                 = "M_EPWM2";
epwm4.epwmCounterCompare_cmpA                                  = 560;
epwm4.epwmDeadband_delayRED                                    = 80;
epwm4.epwmDeadband_delayFED                                    = 80;
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_PERIOD  = "EPWM_AQ_OUTPUT_TOGGLE";
epwm4.epwmGlobalLoad_gld                                       = true;
epwm4.epwmGlobalLoad_globalePWMLoadLink                        = "EPWM_LINK_WITH_EPWM_3";
epwm4.epwmGlobalLoad_gldPeriod                                 = "1";
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_A_gld                 = true;
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_A_shadowMode          = true;
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_A_shadowEvent         = "EPWM_AQ_LOAD_ON_CNTR_PERIOD";
epwm4.epwmGlobalLoad_enableOneShot                             = true;
epwm4.epwmGlobalLoad_oneShotMode                               = true;
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_B_shadowMode          = true;
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_B_gld                 = true;
epwm4.epwmTimebase_periodLink                                  = "EPWM_LINK_WITH_EPWM_3";
epwm4.epwmGlobalLoad_gldMode                                   = "EPWM_GL_LOAD_PULSE_CNTR_ZERO_PERIOD";
epwm4.epwmActionQualifier_continousSwForceReloadMode           = "EPWM_AQ_SW_SH_LOAD_ON_CNTR_ZERO_PERIOD";
epwm4.epwmTimebase_period                                      = 1120;
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_ZERO    = "EPWM_AQ_OUTPUT_LOW";
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA = "EPWM_AQ_OUTPUT_HIGH";
epwm4.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZA                    = "EPWM_TZ_ACTION_LOW";
epwm4.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZB                    = "EPWM_TZ_ACTION_LOW";
epwm4.epwm.$assign                                             = "EPWM4";
epwm4.epwm.epwm_aPin.$assign                                   = "GPIO6";
epwm4.epwm.epwm_bPin.$assign                                   = "GPIO7";

epwm5.$name                                                   = "M_EPWM5";
epwm5.epwmTimebase_hsClockDiv                                 = "EPWM_HSCLOCK_DIVIDER_1";
epwm5.epwmTimebase_counterMode                                = "EPWM_COUNTER_MODE_UP";
epwm5.epwmCounterCompare_cmpA                                 = 250;
epwm5.epwmCounterCompare_cmpB                                 = 250;
epwm5.epwmDeadband_polarityFED                                = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm5.hrpwm_edgeModeA                                         = "HRPWM_MEP_CTRL_RISING_AND_FALLING_EDGE";
epwm5.hrpwm_HRLoadA                                           = "HRPWM_LOAD_ON_CNTR_ZERO_PERIOD";
epwm5.hrpwm_edgeModeB                                         = "HRPWM_MEP_CTRL_RISING_AND_FALLING_EDGE";
epwm5.hrpwm_HRLoadB                                           = "HRPWM_LOAD_ON_CNTR_ZERO_PERIOD";
epwm5.hrpwm_edgeModeDB                                        = "HRPWM_DB_MEP_CTRL_RED_FED";
epwm5.hrpwm_DBredHR                                           = 2;
epwm5.hrpwm_DBfedHR                                           = 2;
epwm5.epwmDeadband_enableRED                                  = true;
epwm5.epwmDeadband_redShadowMode                              = true;
epwm5.epwmDeadband_delayRED                                   = 20;
epwm5.epwmDeadband_enableFED                                  = true;
epwm5.epwmDeadband_fedShadowMode                              = true;
epwm5.epwmDeadband_delayFED                                   = 20;
epwm5.epwmDeadband_deadbandCounterClockRate                   = "EPWM_DB_COUNTER_CLOCK_HALF_CYCLE";
epwm5.copyUse                                                 = true;
epwm5.epwmTimebase_period                                     = 500;
epwm5.epwmTimebase_syncOutPulseMode                           = "EPWM_SYNC_OUT_PULSE_ON_EPWMxSYNCIN";
epwm5.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_PERIOD = "EPWM_AQ_OUTPUT_TOGGLE";
epwm5.copyFrom                                                = "M_EPWM2";
epwm5.epwm.$assign                                            = "EPWM5";
epwm5.epwm.epwm_aPin.$assign                                  = "GPIO8";
epwm5.epwm.epwm_bPin.$assign                                  = "GPIO9";

epwm6.$name                                                   = "M_EPWM6";
epwm6.epwmTimebase_hsClockDiv                                 = "EPWM_HSCLOCK_DIVIDER_1";
epwm6.epwmTimebase_counterMode                                = "EPWM_COUNTER_MODE_UP";
epwm6.epwmCounterCompare_cmpA                                 = 250;
epwm6.epwmCounterCompare_cmpB                                 = 250;
epwm6.epwmDeadband_polarityFED                                = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm6.hrpwm_edgeModeA                                         = "HRPWM_MEP_CTRL_RISING_AND_FALLING_EDGE";
epwm6.hrpwm_HRLoadA                                           = "HRPWM_LOAD_ON_CNTR_ZERO_PERIOD";
epwm6.hrpwm_edgeModeB                                         = "HRPWM_MEP_CTRL_RISING_AND_FALLING_EDGE";
epwm6.hrpwm_HRLoadB                                           = "HRPWM_LOAD_ON_CNTR_ZERO_PERIOD";
epwm6.hrpwm_edgeModeDB                                        = "HRPWM_DB_MEP_CTRL_RED_FED";
epwm6.hrpwm_DBredHR                                           = 2;
epwm6.hrpwm_DBfedHR                                           = 2;
epwm6.epwmDeadband_enableRED                                  = true;
epwm6.epwmDeadband_redShadowMode                              = true;
epwm6.epwmDeadband_delayRED                                   = 20;
epwm6.epwmDeadband_enableFED                                  = true;
epwm6.epwmDeadband_fedShadowMode                              = true;
epwm6.epwmDeadband_delayFED                                   = 20;
epwm6.epwmDeadband_deadbandCounterClockRate                   = "EPWM_DB_COUNTER_CLOCK_HALF_CYCLE";
epwm6.copyUse                                                 = true;
epwm6.epwmTimebase_period                                     = 500;
epwm6.epwmTimebase_syncOutPulseMode                           = "EPWM_SYNC_OUT_PULSE_ON_EPWMxSYNCIN";
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_PERIOD = "EPWM_AQ_OUTPUT_TOGGLE";
epwm6.copyFrom                                                = "M_EPWM2";
epwm6.epwm.$assign                                            = "EPWM6";
epwm6.epwm.epwm_aPin.$assign                                  = "GPIO10";
epwm6.epwm.epwm_bPin.$assign                                  = "GPIO11";

