ZXCLI/Multiphase-Interleaved-CLLC/CLLC.syscfg
epwm7.$name                                                   = "M_EPWM7";
epwm7.epwmTimebase_hsClockDiv                                 = "EPWM_HSCLOCK_DIVIDER_1";
epwm7.epwmTimebase_counterMode                                = "EPWM_COUNTER_MODE_UP";
epwm7.epwmCounterCompare_cmpA                                 = 250;
epwm7.epwmCounterCompare_cmpB                                 = 250;
epwm7.epwmDeadband_polarityFED                                = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm7.hrpwm_edgeModeA                                         = "HRPWM_MEP_CTRL_RISING_AND_FALLING_EDGE";
epwm7.hrpwm_HRLoadA                                           = "HRPWM_LOAD_ON_CNTR_ZERO_PERIOD";
epwm7.hrpwm_edgeModeB                                         = "HRPWM_MEP_CTRL_RISING_AND_FALLING_EDGE";
epwm7.hrpwm_HRLoadB                                           = "HRPWM_LOAD_ON_CNTR_ZERO_PERIOD";
epwm7.hrpwm_edgeModeDB                                        = "HRPWM_DB_MEP_CTRL_RED_FED";
epwm7.hrpwm_DBredHR                                           = 2;
epwm7.hrpwm_DBfedHR                                           = 2;
epwm7.epwmDeadband_enableRED                                  = true;
epwm7.epwmDeadband_redShadowMode                              = true;
epwm7.epwmDeadband_delayRED                                   = 20;
epwm7.epwmDeadband_enableFED                                  = true;
epwm7.epwmDeadband_fedShadowMode                              = true;
epwm7.epwmDeadband_delayFED                                   = 20;
epwm7.epwmDeadband_deadbandCounterClockRate                   = "EPWM_DB_COUNTER_CLOCK_HALF_CYCLE";
epwm7.copyUse                                                 = true;
epwm7.epwmTimebase_period                                     = 500;
epwm7.epwmTimebase_syncOutPulseMode                           = "EPWM_SYNC_OUT_PULSE_ON_EPWMxSYNCIN";
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_PERIOD = "EPWM_AQ_OUTPUT_TOGGLE";
epwm7.copyFrom                                                = "M_EPWM2";
epwm7.epwm.$assign                                            = "EPWM7";
epwm7.epwm.epwm_aPin.$assign                                  = "GPIO12";
epwm7.epwm.epwm_bPin.$assign                                  = "GPIO13";

epwm8.$name                                                   = "M_EPWM8";
epwm8.epwmTimebase_hsClockDiv                                 = "EPWM_HSCLOCK_DIVIDER_1";
epwm8.epwmDeadband_polarityFED                                = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm8.hrpwm_HRLoadA                                           = "HRPWM_LOAD_ON_CNTR_ZERO_PERIOD";
epwm8.hrpwm_HRLoadB                                           = "HRPWM_LOAD_ON_CNTR_ZERO_PERIOD";
epwm8.hrpwm_edgeModeA                                         = "HRPWM_MEP_CTRL_RISING_AND_FALLING_EDGE";
epwm8.epwmCounterCompare_cmpA                                 = 250;
epwm8.epwmCounterCompare_cmpB                                 = 250;
epwm8.hrpwm_edgeModeDB                                        = "HRPWM_DB_MEP_CTRL_RED_FED";
epwm8.hrpwm_edgeModeB                                         = "HRPWM_MEP_CTRL_RISING_AND_FALLING_EDGE";
epwm8.epwmTimebase_counterMode                                = "EPWM_COUNTER_MODE_UP";
epwm8.hrpwm_DBredHR                                           = 2;
epwm8.hrpwm_DBfedHR                                           = 2;
epwm8.epwmDeadband_enableRED                                  = true;
epwm8.epwmDeadband_redShadowMode                              = true;
epwm8.epwmDeadband_delayRED                                   = 20;
epwm8.epwmDeadband_enableFED                                  = true;
epwm8.epwmDeadband_fedShadowMode                              = true;
epwm8.epwmDeadband_delayFED                                   = 20;
epwm8.epwmDeadband_deadbandCounterClockRate                   = "EPWM_DB_COUNTER_CLOCK_HALF_CYCLE";
epwm8.copyUse                                                 = true;
epwm8.epwmTimebase_period                                     = 500;
epwm8.epwmTimebase_syncOutPulseMode                           = "EPWM_SYNC_OUT_PULSE_ON_EPWMxSYNCIN";
epwm8.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_PERIOD = "EPWM_AQ_OUTPUT_TOGGLE";
epwm8.copyFrom                                                = "M_EPWM2";
epwm8.epwm.$assign                                            = "EPWM8";
epwm8.epwm.epwm_aPin.$assign                                  = "GPIO14";
epwm8.epwm.epwm_bPin.$assign                                  = "GPIO15";

gpio1.$name     = "FAULT_INPUT1";
gpio1.padConfig = "PULLUP";

gpio2.$name           = "FAULT_INPUT2";
gpio2.gpioPin.$assign = "GPIO29";

gpio3.$name           = "FAULT_OUTPUT";
gpio3.direction       = "GPIO_DIR_MODE_OUT";
gpio3.gpioPin.$assign = "GPIO31";

gpio4.$name           = "DEBUG1";
gpio4.direction       = "GPIO_DIR_MODE_OUT";
gpio4.gpioPin.$assign = "GPIO30";

gpio5.$name           = "ACTIVE1";
gpio5.gpioPin.$assign = "GPIO34";

gpio6.$name           = "ACTIVE2";
gpio6.gpioPin.$assign = "GPIO59";

gpio7.$name             = "STATUS1";
gpio7.direction         = "GPIO_DIR_MODE_OUT";
gpio7.writeInitialValue = true;
gpio7.initialValue      = 1;
gpio7.gpioPin.$assign   = "GPIO39";

gpio8.$name             = "STATUS2";
gpio8.direction         = "GPIO_DIR_MODE_OUT";
gpio8.writeInitialValue = true;
gpio8.initialValue      = 1;
gpio8.gpioPin.$assign   = "GPIO40";

gpio9.$name                      = "PRIM_ZCD1";
gpio9.padConfig                  = "PULLUP";
gpio9.useInterrupt               = true;
gpio9.gpioPin.$assign            = "GPIO23_VSW";
gpio9.xint.intType               = "GPIO_INT_TYPE_BOTH_EDGES";
gpio9.xint.registerInterrupts    = true;
gpio9.xint.enableInt             = true;
gpio9.xint.xInt.interruptHandler = "ISR1_PZCD";

gpio10.$name           = "PRIM_ZCD2";
gpio10.gpioPin.$assign = "GPIO22_VFBSW";

gpio11.$name           = "DEBUG2";
gpio11.direction       = "GPIO_DIR_MODE_OUT";
gpio11.gpioPin.$assign = "GPIO58";

gpio12.$name           = "FAN2";
gpio12.direction       = "GPIO_DIR_MODE_OUT";
gpio12.gpioPin.$assign = "GPIO35/TDI";

