ZXCLI/Multiphase-Interleaved-CLLC/CLLC.syscfg
gpio13.$name           = "SEC_ZCD1";
gpio13.gpioPin.$assign = "GPIO33";

gpio14.$name           = "SEC_ZCD2";
gpio14.gpioPin.$assign = "GPIO17";

inputxbar_input1.$name         = "myINPUTXBARINPUT0";
gpio9.xint.inputxbar           = inputxbar_input1;
inputxbar_input1.inputxbarGpio = "GPIO23";

inputxbar_input2.$name         = "TZ1";
inputxbar_input2.inputxbarGpio = "GPIO28";

inputxbar_input3.$name          = "TZ2";
inputxbar_input3.inputxbarInput = "XBAR_INPUT2";
inputxbar_input3.inputxbarGpio  = "GPIO29";

outputxbar1.$name                            = "FAN1";
outputxbar1.sourceSignals                    = ["ECAP1_OUT"];
outputxbar1.useSourceSelect                  = true;
outputxbar1.outputxbar.$assign               = "OUTPUTXBAR2";
outputxbar1.outputxbar.outputxbarPin.$assign = "GPIO37/TDO";

pmbus1.$name                        = "myPMBUS0";
pmbus1.pmbus.pmbus_alertPin.$assign = "GPIO27";
pmbus1.pmbus.pmbus_ctlPin.$assign   = "GPIO26";
pmbus1.pmbus.pmbus_sclPin.$assign   = "GPIO16";
pmbus1.pmbus.pmbus_sdaPin.$assign   = "GPIO25";

sci1.$name                 = "DEBUG";
sci1.useInterrupts         = false;
sci1.sci.$assign           = "SCIB";
sci1.sci.sci_rxPin.$assign = "GPIO57";
sci1.sci.sci_txPin.$assign = "GPIO56";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
epwm1.epwm.epwm_aPin.$suggestSolution = "GPIO0";
epwm1.epwm.epwm_bPin.$suggestSolution = "GPIO1";
gpio1.gpioPin.$suggestSolution        = "GPIO28";
pmbus1.pmbus.$suggestSolution         = "PMBUSA";
